int/resources/objectRepo/xmlTemplates/ows/OWSReservation/req_StayHistory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/" xmlns:stay="http://webservices.micros.com/ows/5.1/StayHistory.wsdl">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="?" primaryLangID="?" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <stay:StayHistoryRequest>
         <stay:QueryDateRange>
            <hot:StartDate/>
            <hot:Duration/>
            <hot:EndDate/>
         </stay:QueryDateRange>
         <stay:CorporateID source="?" type="?"/>
         <stay:NameID source="?" type="?"/>
      </stay:StayHistoryRequest>
   </soapenv:Body>
</soapenv:Envelope>